def jsmi(a, b):

    print("ჯამი არის:", a + b)


jsmi(3, 4)   
jsmi(10, 5)
jsmi(0, 8)   
jsmi(100, 250) 
jsmi(-5, 5)  

# ფუნქცია არის კოდის განკუთვნილი ბლოკი, რომელიც ასრულებს კონკრეტულ ამოცანას
#   რატომ ვიყენებთ ფუნქციებს?
# - კოდის გამეორების თავიდან ასაცილებლად
# - კოდის სტრუქტურირებისა და ორგანიზებისათვის
# - მოდულური პროგრამირებისათვის (კოდი ადვილად გასაგები და გასასწორებელია)
# - დაზოგავს დროს: ერთი და იგივე კოდი არ უნდა დავწეროთ ბევრჯერ
# - ამარტივებს შეცდომების პოვნასა და შესწორებას
# - გვაძლევს შესაძლებლობას, ერთი ფუნქცია სხვადასხვა მონაცემზე გამოვიყენოთ

# სიტყვით `def`, შემდეგ ფუნქციის სახელი, შემდეგ ფრჩხილებში პარამეტრები და ბოლოს კოდების ბლოკი.
