# static – სტანდარტული პოზიციონირება

# ახასიათებს

#  ეს არის ყველა ელემენტის საწყისი მდგომარეობა როცა position საერთოდ არ არის მითითებული
#  ელემენტი დოკუმენტის ნაკადშია რიგში სხვა ელემენტებთან ერთად
#  არ მოქმედებს top left right bottom პარამეტრები
#  და არ გადაადგილდება


# relative – ფარდობითი პოზიციონირება

# ახასიათებს

#  ელემენტი მოძრაობს თავისი საწყისი პოზიციიდან მაგრამ ისევ იკავებს იმავე ადგილს დოკუმენტის ნაკადში
#  გაადგილება შეგიძლია  top, left, right, bottom თვისებებით
#  სხვა ელემენტები მაინც ფიქრობენ რომ ის არ გაწეულა
#  მისი შიგნით განთავსებული absolute ელემენტები მასთან შედარებით განლაგდებიან.


# absolute – აბსოლუტური პოზიციონირება

# ელემენტი მთლიანად ამოღებულია დოკუმენტის ნაკადიდან და პოზიციონირდება მშობლის მიმართ

# ახასიათებს

# რომელსაც აქვს relative ან სხვა პოზიციონირება
# არ იკავებს ადგილს  სხვა ელემენტები არ ითვალისწინებენ
# განლაგდება უახლოესი relative absolute ან fixed მშობლის მიმართ
# მუშაობს top left right bottom თვისებებთან


# fixed  ფიქსირებული პოზიციონირება

# ახასიათებს

# არ მოძრაობს გვერდის scrollის დროს
# არ არის დოკუმენტის ნაკადში
# მუშაობს top left right bottom თვისებებთან
